export interface Stage {
  name: string;
  x: number;
  y: number;
}

// 変換基準：1920x1080の画像に基づくSVG座標
export const stages: Stage[] = [
  { name: 'カルミナ', x: 1580, y: 131 },
  { name: 'ノルネ', x: 1540, y: 220},
  { name: 'ネイア', x: 1265, y: 150 },
  { name: 'ノクス', x: 1650, y: 288 },
  { name: 'ヴァリア城', x: 1550, y: 319 },
  { name: 'セグリア', x: 1600, y: 380 },
  { name: 'ミレア', x: 1443, y: 510 },
  { name: 'フェルモーラの里', x: 1455, y: 580 },
  { name: 'ノヴァの隠れ里', x: 1410, y: 716 },
  { name: 'リヴィアの里', x: 1286.4, y: 820 },
  { name: 'ヨハの隠れ家', x: 1220, y: 880 },
  { name: 'アルミナ', x: 1196, y: 700 },
  { name: 'ルナリオ岬', x: 1110, y: 677 },
  { name: 'グランベルト城', x: 1598, y: 765 },
  { name: 'ケリス岬', x: 1636, y: 604 },
  { name: 'カイロス', x: 1630, y: 505 },
  { name: 'オルミス城', x: 1267.2, y: 468 },
  { name: 'オルミス旧市街', x: 1090, y: 355 },
  { name: 'カリスの里', x: 965, y: 626.4 },
  { name: 'グランディール城', x: 800, y: 530 },
  { name: 'アークス塔', x: 665, y: 830 },
  { name: 'オルセア', x: 828, y: 780 },
  { name: 'セレスタ', x: 533, y: 710 },
  { name: 'ザハラ塔', x: 368, y: 833 },
  { name: 'サリファ', x: 330, y: 646 },
  { name: 'エルミナス城', x: 450, y: 360 },
  { name: 'ベルネール', x: 380, y: 325 },
  { name: 'エルド城', x: 525, y: 246 },
  { name: 'グランティア城', x: 395, y: 147 },
  { name: 'ミルティア城', x: 545, y: 103 },
  { name: 'エルシードの双子塔', x: 793, y: 189 },
  { name: 'シャルティア塔', x: 960, y: 290 },
  { name: 'バルガの洞窟', x: 1277, y: 273 },
  { name: 'ヴァルマリス海底神殿', x: 955, y: 490 },
  { name: '黒の塔', x: 1494, y: 808 },
  { name: '賢者の城', x: 330, y: 440 },
];
